
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024	
// Пересчитываем сумму строки с учетом согласованной скидки
Если Объект.АЗ_СогласованнаяСкидка + ТекущиеДанные.Скидка <= 100 Тогда
	    СогласованнаяСкидка = ТекущиеДанные.Цена * ТекущиеДанные.Количество * (Объект.АЗ_СогласованнаяСкидка / 100);
		ТекущиеДанные.Сумма = ТекущиеДанные.Сумма - СогласованнаяСкидка; 
	Иначе
		ТекущиеДанные.Сумма = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("По номенклатуре %1 cумма согласованной скидки и скидки не должна превышать 100", 
		ТекущиеДанные.Номенклатура);  
		Сообщение.Сообщить();
КонецЕсли;
 
//  Золотарев А.А.}}
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура АЗ_СогласованнаяСкидкаПриИзменении(Элемент)
	// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024
	// Формирование вопроса при изменении поля Согласованная скидка
	СогласованнаяСкидкаПриИзменении();	
	//  Золотарев А.А.}}
КонецПроцедуры

&НаКлиенте
Асинх Процедура СогласованнаяСкидкаПриИзменении()
	// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024
	// Формирование вопроса при изменении поля Согласованная скидка
	
	ДанныеТовары = Объект.Товары.Количество();
	ДанныеУслуги = Объект.Услуги.Количество();
	
	Если ДанныеТовары > 0 Или ДанныеУслуги > 0 Тогда
		
		Вопрос = ВопросАсинх("Скидка изменилась. Пересчитать товары и услуги?", РежимДиалогаВопрос.ДаНет);
		Ответ = Ждать Вопрос;
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			
			ПересчитатьТаблицуТоварыСоСкидкой();
			ПересчитатьТаблицуУслугисоСкидуой();
			
		КонецЕсли;
		
	КонецЕсли;
	//  Золотарев А.А.}}
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицуТоварыСоСкидкой()
	// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024
	// Пересчитываем строку из таблицы Товары	
	Для Каждого Строка из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла;
	РассчитатьСуммуДокумента();
    //  Золотарев А.А.}}
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицуУслугисоСкидуой()
	
	// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024
	// Пересчитываем строку из таблицы Услуги	
	Для Каждого Строка из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла;
	РассчитатьСуммуДокумента();
    //  Золотарев А.А.}}
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-check module-unused-method
&НаКлиенте
Процедура АЗ_ПересчитатьТаблицу(Команда)
	// {{ Золотарев А.А. Задача: "Добавление поля Согласованная скидка" 01.11.2024
	// Обработка кнопки Пересчитать таблицу
	ПересчитатьТаблицуТоварыСоСкидкой();
	ПересчитатьТаблицуУслугисоСкидуой();
    //  Золотарев А.А.}}
КонецПроцедуры

#КонецОбласти

#КонецОбласти










	
